QUESTION = {
    "q1": {
        "question_title": "Как часто следует проводить регрессионное тестирование продукта?",
        "question_body": "Вопрос проверяет понимание важности регулярного регрессионного тестирования и факторов, влияющих на его частоту.",
        "answer": "Регрессионное тестирование следует проводить после каждого изменения кода, такого как исправление багов, добавление новых функций или рефакторинг. Частота зависит от объема изменений и стадии разработки продукта: на этапах активной разработки оно проводится чаще, а на стадии поддержки — реже, при необходимости.",
        "category": "QA",
    },
    "q2": {
        "question_title": "Что такое техника анализа предельных значений? В чем ценность этой техники?",
        "question_body": "Вопрос проверяет знание метода тестирования значений на границах диапазонов, где чаще всего возникают ошибки.",
        "answer": "Анализ предельных значений — это техника тестирования, которая фокусируется на проверке данных, находящихся на границах допустимого диапазона. Ценность этой техники в том, что ошибки чаще возникают именно на границах, поэтому тестирование таких значений помогает выявить дефекты.",
        "category": "QA",
    },
    "q3": {
        "question_title": "Что такое техника анализа классов эквивалентности?",
        "question_body": "Вопрос проверяет знание метода оптимизации тестов путем разделения данных на классы с эквивалентным поведением.",
        "answer": "Анализ классов эквивалентности — это техника тест-дизайна, при которой входные данные делятся на группы, называемые классами эквивалентности. Все значения внутри одного класса считаются обрабатываемыми системой одинаково, поэтому для тестирования достаточно выбрать одно значение из каждого класса.",
        "category": "QA",
    },
    "q4": {
        "question_title": "Какие техники тест-дизайна знаете?",
        "question_body": "Вопрос проверяет знание основных техник тест-дизайна, которые применяются для создания тест-кейсов",
        "answer": "Среди популярных техник тест-дизайна можно выделить эквивалентное разбиение, анализ граничных значений, таблицы решений и тестирование переходов состояний. Эти техники помогают создавать эффективные тесты, минимизируя избыточность и охватывая ключевые сценарии.",
        "category": "QA",
    },
    "q5": {
        "question_title": "Какие уровни тестирования знаете?",
        "question_body": "Вопрос проверяет знание уровней тестирования и их последовательности в процессе разработки.",
        "answer": "Основные уровни тестирования: модульное, интеграционное, системное и приемочное. Они применяются для проверки продукта от самых мелких компонентов до его полной функциональности в реальных условиях.",
        "category": "QA",
    },
}
